<?php
$url = Yii::$app->urlManager;
?>

<div>
    <div class="service-img">
        <span class="dark_bg"></span>
    </div>
    <div class="page_conten">
        <div class="c"><h1 class="h1-margin">سرویس و نگهداری</h1>
            <p>
                سرویس و نگهداری آسانسور عبارتست از بازیینی کلی قطعات نصب شده و نظارت مستمر بر عملکرد کلی سیستم پس از نصب
                آسانسور. بطور کلی هیچ سیستم یا مکانیزمی وجود ندارد که نیازمند سرویس و نگهداری و بازبینی دوره ای نباشد به
                ویژه سیستمهایی که ایمنی آنها نقش اساسی در عملکرد کلی سیستم ایفا می نماید و خرابی آنها باعث خطرات احتمالی
                جانی می گردد. از اینرو اهمیت سرویس و نگهداری آسانسور کمتر از اهمیت نصب آسانسور نبوده و یک آسانسور صرفنظر
                از نوع آن و شرکت سازنده آن ، می بایست بطور منظم و حداقل ماهانه یک بار توسط شخص یا اشخاص متخصص تحت بازرسی
                منظم قرار گیرد.

                سرویس و نگهداری آسانسور را از لحاظ توجیه پذیری اقتصادی نیز می توان بررسی نمود. بطور کلی بدیهی است اگر
                قطعه یا قطعاتی در شرف خرابی یا آستانه فرسودگی قرار بگیرند در صورتیکه به موقع تعویض یا تعمیر نگردند
                احتمالا باعث اختلال در عملکرد قطعات دیگر نیز خواهند بود، و یا ممکن است خرابی آنها صدمات جبران ناپذیری به
                کل سیستم وارد نماید. حتی وقوع خطرات جانی در بدترین حالت ممکن است. فرض کنید طنابهای فولادی (wire ropes)
                آسانسور یا همان سیم بکسل آسانسور در آستانه فرسودگی قرار گرفته است . این فرسودگی و یا خوردگی سیم بکسلها
                باعث خوردگی فلکه های کششی موتور و هرزگرد می شود بنابراین فلکه های کششی نیز در معرض فرسودگی قرار میگیرند
                و در حالتیکه ترمز ایمنی آسانسور (پاراشوت) فعال و تنظیم نباشد پارگی سیم بکسل باعث سقوط آسانسور شده و منجر
                به آسیب های جبران ناپذیر جانی و مالی خواهد بود.

                بنابر مطالب فوق از لحاظ توجیه پذیری اقتصادی و از لحاظ ایمنی و منطقی یک آسانسور صرف نظر از نوع و شرکت
                سازنده میبایست بطور منظم و حداقل ماهانه یک بار توسط شرکتهای دارای صلاحیت، تحت بازرسی منظم قرار گیرد.
            </p>
            <table class="table font_xs ">
                <thead>
                <tr>
                    <th scope="col">تعداد طبقه</th>
                    <th scope="col">تعداد توقف</th>
                    <th scope="col">مدت</th>
                    <th scope="col">قیمت</th>

                </tr>
                </thead>
                <tbody>
                <?php $service1 = \backend\models\Service::find()->where(['enable' => 1])->andWhere(['enable_view' => 1])->all();
                if ($service1 != null) {
                    foreach ($service1 as $ser) {;
                        ?>
                        <tr>
                            <th scope="col"><?= $ser->floornamber?></th>
                            <th scope="col"><?= $ser->numderstop?></th>
                            <th scope="col"><?= $ser->duration?> ماه</th>
                            <th scope="col"><?= $ser->price?>تومان</th>
                            <th scope="col"><a href="<?= $url->createAbsoluteUrl(['servicebuy/create','id'=>$ser->id])?>">درخواست</a></th>
                        </tr>
                        <?php
                    }
                }
                ?>
                </tbody>
            </table>
        </div>
    </div>
</div>

